<a href="https://colab.research.google.com/github/ajanaferreira/bootcampdataanalytics/blob/main/Exerc%C3%ADcios_bd_sql_JanainaFS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql

In [ ]:
%%sql
sqlite:///exerciciobd.db

### Exercício 1

In [ ]:
%%sql
CREATE TABLE alunos (id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100));

 * sqlite:///exerciciobd.db
Done.

[]

In [ ]:
%%sql
SELECT * FROM alunos

 * sqlite:///exerciciobd.db
Done.

[]

### Exercício 2

In [ ]:
%%sql
INSERT INTO alunos (id, nome, idade, curso) VALUES (1, 'Janaina', 29, 'Analise de dados'), (2, 'Renan', 26, 'Analise de sistemas'), (3, 'Lua', 20, 'Gestão de pessoas'), (4, 'Catarina', 22, 'Publicidade e propaganda'), (5, 'Caleb', 21, 'Arquiteto');

 * sqlite:///exerciciobd.db
5 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM alunos

 * sqlite:///exerciciobd.db
Done.

[(1, 'Janaina', 29, 'Analise de dados'),
 (2, 'Renan', 26, 'Analise de sistemas'),
 (3, 'Lua', 20, 'Gestão de pessoas'),
 (4, 'Catarina', 22, 'Publicidade e propaganda'),
 (5, 'Caleb', 21, 'Arquiteto')]

### Exercício 3

In [ ]:
%%sql
SELECT * FROM alunos

 * sqlite:///exerciciobd.db
Done.

[(1, 'Janaina', 29, 'Analise de dados'),
 (2, 'Renan', 26, 'Analise de sistemas'),
 (3, 'Lua', 20, 'Gestão de pessoas'),
 (4, 'Catarina', 22, 'Publicidade e propaganda'),
 (5, 'Caleb', 21, 'Arquiteto')]

In [ ]:
%%sql
SELECT nome, idade FROM alunos WHERE idade > 20

 * sqlite:///exerciciobd.db
Done.

[('Janaina', 29), ('Renan', 26), ('Catarina', 22), ('Caleb', 21)]

In [ ]:
%%sql
SELECT * FROM alunos WHERE curso = 'Analise de dados' ORDER BY nome ASC;

 * sqlite:///exerciciobd.db
Done.

[(1, 'Janaina', 29, 'Analise de dados')]

In [ ]:
%%sql
SELECT COUNT(*) FROM alunos

 * sqlite:///exerciciobd.db
Done.

[(5,)]

### Exercício 4

In [ ]:
%%sql
UPDATE alunos SET idade = 18 WHERE nome = "Lua";

 * sqlite:///exerciciobd.db
1 rows affected.

[]

In [ ]:
%%sql
DELETE FROM alunos WHERE id = 2;

 * sqlite:///exerciciobd.db
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM alunos

 * sqlite:///exerciciobd.db
Done.

[(1, 'Janaina', 29, 'Analise de dados'),
 (3, 'Lua', 18, 'Gestão de pessoas'),
 (4, 'Catarina', 22, 'Publicidade e propaganda'),
 (5, 'Caleb', 21, 'Arquiteto')]

### Exercício 5

In [ ]:
%%sql
CREATE TABLE clientes (id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT);
INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, 'Joyce', 29, 9600), (2, 'Graziele', 32, 2500), (3, 'Maria', 38, 7300), (4, 'Gabriela', 29, 6540), (5, 'Beatriz', 30, 5200), (6, 'Jayane', 22, 500);

 * sqlite:///exerciciobd.db
Done.
6 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM clientes

 * sqlite:///exerciciobd.db
Done.

[(1, 'Joyce', 29, 9600.0),
 (2, 'Graziele', 32, 2500.0),
 (3, 'Maria', 38, 7300.0),
 (4, 'Gabriela', 29, 6540.0),
 (5, 'Beatriz', 30, 5200.0),
 (6, 'Jayane', 22, 500.0)]

### Exercício 6

In [ ]:
%%sql
SELECT nome, idade FROM clientes WHERE idade > 30

 * sqlite:///exerciciobd.db
Done.

[('Graziele', 32), ('Maria', 38)]

In [ ]:
%%sql
SELECT AVG(saldo) FROM clientes

 * sqlite:///exerciciobd.db
Done.

[(5273.333333333333,)]

In [ ]:
%%sql
SELECT * FROM clientes ORDER BY saldo DESC LIMIT 1;

 * sqlite:///exerciciobd.db
Done.

[(1, 'Joyce', 29, 9600.0)]

In [ ]:
%%sql
SELECT COUNT(*) FROM clientes WHERE saldo > 1000;

 * sqlite:///exerciciobd.db
Done.

[(5,)]

### Exercício 7

In [ ]:
%%sql
UPDATE clientes SET saldo = 3500 WHERE nome = 'Graziele';

 * sqlite:///exerciciobd.db
1 rows affected.

[]

In [ ]:
%%sql
DELETE FROM clientes WHERE id = 5;

 * sqlite:///exerciciobd.db
1 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM clientes

 * sqlite:///exerciciobd.db
Done.

[(1, 'Joyce', 29, 9600.0),
 (2, 'Graziele', 32, 3500.0),
 (3, 'Maria', 38, 7300.0),
 (4, 'Gabriela', 29, 6540.0),
 (6, 'Jayane', 22, 500.0)]

### Exercício 8

In [ ]:
%%sql
CREATE TABLE compras (id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor FLOAT, FOREIGN KEY (cliente_id) REFERENCES clientes(id));

 * sqlite:///exerciciobd.db
Done.

[]

In [ ]:
%%sql
SELECT * FROM compras

 * sqlite:///exerciciobd.db
Done.

[]

In [ ]:
%%sql
INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 4, 'Tiara', 39.90), (2, 1, 'Vestido', 79), (3, 6, 'Livro', 29.90);

 * sqlite:///exerciciobd.db
3 rows affected.

[]

In [ ]:
%%sql
SELECT clientes.nome, compras.produto, compras.valor FROM compras JOIN clientes ON compras.cliente_id = clientes.id;

 * sqlite:///exerciciobd.db
Done.

[('Gabriela', 'Tiara', 39.9),
 ('Joyce', 'Vestido', 79.0),
 ('Jayane', 'Livro', 29.9)]